АлогистикТест2/src/Documents/алк_ИнвентаризацияПоСериям/алк_ИнвентаризацияПоСериям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ИнвентаризацияПоСериям</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзлишки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНедостача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыРеальные</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПакета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидыОперацийПеремещениеЗапасов/алк_ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>ПередачаИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеРасформированныхПакетов</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаУпаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСобственные</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаРеализацию</name>
  </enumValues>
  <enumValues>
    <name>РеализацияЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеПакета</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСПереупаковки</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаС_ЦПШ</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаПереупаковку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСушку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушки</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВСушильнуюКамеру</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСушильнойКамеры</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВНезавершенноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПередачаСНезавершенногоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаНаСГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаССушкиСырых</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УПП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_СГП</name>
  </enumValues>
  <enumValues>
    <name>ПередачаИзПроизводства_УРП_Магазин</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ИнвентаризацияПоСериям/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства) Экспорт
		
	СформироватьТаблицаЗапасыНаСкладахСерии(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства);
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаИнвентаризация.Дата) Тогда
		СформироватьТаблицуПроизводствоОборот(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства);
		СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства);	
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

КонецПроцедуры 
	
#Область Проведение

Процедура СформироватьТаблицаЗапасыНаСкладахСерии(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Организация КАК Организация,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ячейка КАК Ячейка,
	|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
	|	&Период,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.ДатаСмены,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Смена,
	|	алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ИнвентаризацияПоСериямЗапасы.Номенклатура,
	|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки КАК КоличествоПакетов,
	|	&Операция
	|ИЗ
	|	Документ.алк_ИнвентаризацияПоСериям.Запасы КАК алк_ИнвентаризацияПоСериямЗапасы
	|ГДЕ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ссылка = &Ссылка
	|	И алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Организация,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ячейка,
	|	&ВидДвиженияНакопленияРасход,
	|	&Период,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.ДатаСмены,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Смена,
	|	алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер,
	|	алк_ИнвентаризацияПоСериямЗапасы.Номенклатура,
	|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача,
	|	&Операция
	|ИЗ
	|	Документ.алк_ИнвентаризацияПоСериям.Запасы КАК алк_ИнвентаризацияПоСериямЗапасы
	|ГДЕ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ссылка = &Ссылка
	|	И алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИнвентаризация);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаИнвентаризация.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Операция", Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Инвентаризация);	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

//Формирует таблицу значений, для отражения в алк_ПроизводствоОборот Дубоделов Э.А
Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	0 КАК Бригада,
	|	ВЫБОР
	|		КОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	|	КОНЕЦ КАК ВидДвиженияПроизводства,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.ДатаСмены КАК ДатаСмены,
	|	алк_ИнвентаризацияПоСериямЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание)
	|	КОНЕЦ КАК Операция,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Организация КАК Организация,
	|	алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.СтруктурнаяЕдиница КАК Склад,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Смена КАК Смена,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Дата КАК Период,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ТОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки * алк_ПараметрыПакетовСрезПоследних.Объем
	|		ИНАЧЕ алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача * алк_ПараметрыПакетовСрезПоследних.Объем
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.алк_ИнвентаризацияПоСериям.Запасы КАК алк_ИнвентаризацияПоСериямЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ссылка = &Ссылка
	|	И (алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ИЛИ алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача > 0)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИнвентаризация);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаРезультат);	
	
КонецПроцедуры

//Формирует таблицу значений, для отражения в алк_ОстаткиЗапасов Дубоделов Э.А
Процедура СформироватьТаблицуОстаткиЗапасов(ДокументСсылкаИнвентаризация, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Организация КАК Организация,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	0 КАК Штабель,
	|	ВЫБОР
	|		КОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Дата КАК Период,
	|	алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ИнвентаризацияПоСериямЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ТОГДА алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки * алк_ПараметрыПакетовСрезПоследних.Объем
	|		ИНАЧЕ алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача * алк_ПараметрыПакетовСрезПоследних.Объем
	|	КОНЕЦ КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.Инвентаризация) КАК Операция,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат
	|ИЗ
	|	Документ.алк_ИнвентаризацияПоСериям.Запасы КАК алк_ИнвентаризацияПоСериямЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ссылка = &Ссылка
	|	И (алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки > 0
	|			ИЛИ алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача > 0)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИнвентаризация);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаРезультат);	
	
КонецПроцедуры

#КонецОбласти

	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкИнвентаризации") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БланкИнвентаризации", "Бланк нвентаризации", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "БланкИнвентаризации"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "БланкИнвентаризации";
		КомандаПечати.Представление = НСтр("ru = 'Бланк инвентаризации'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 1;
				
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.Защита = Истина;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "БланкИнвентаризации" Тогда
				
				СформироватьБланкИнвентаризации(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	
	// Процедура формирования бланка инвентаризации
	//
	Процедура СформироватьБланкИнвентаризации(ТабДок, ТекущийДокумент)
		
		Если Ложь Тогда                      		
			ТабДок = Новый ТабличныйДокумент;		
		КонецЕсли; 
		
		Макет = Документы.алк_ИнвентаризацияПоСериям.ПолучитьМакет("БланкИнвентаризации");
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Дата КАК Дата,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Комментарий КАК Комментарий,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ответственный КАК Ответственный,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Смена КАК Смена,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка.Ячейка КАК Ячейка,
		|	алк_ИнвентаризацияПоСериямЗапасы.НомерСтроки,
		|	алк_ИнвентаризацияПоСериямЗапасы.Номенклатура,
		|	алк_ИнвентаризацияПоСериямЗапасы.СерийныйНомер,
		|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоФакт КАК КоличествоФакт,
		|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоУчет КАК КоличествоУчет,
		|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоИзлишки КАК КоличествоИзлишки,
		|	алк_ИнвентаризацияПоСериямЗапасы.КоличествоНедостача КАК КоличествоНедостача
		|ИЗ
		|	Документ.алк_ИнвентаризацияПоСериям.Запасы КАК алк_ИнвентаризацияПоСериямЗапасы
		|ГДЕ
		|	алк_ИнвентаризацияПоСериямЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ДатаСмены),
		|	МАКСИМУМ(Комментарий),
		|	МАКСИМУМ(Ответственный),
		|	МАКСИМУМ(Смена),
		|	МАКСИМУМ(СтруктурнаяЕдиница),
		|	МАКСИМУМ(Ячейка),
		|	СУММА(КоличествоФакт),
		|	СУММА(КоличествоУчет),
		|	СУММА(КоличествоИзлишки),
		|	СУММА(КоличествоНедостача)
		|ПО
		|	Номер";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаОбщийИтог.Следующий();		// Общий итог
			
		ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
		Шапка 					= Макет.ПолучитьОбласть("Шапка");
		ОбластьЗапасыШапка 		= Макет.ПолучитьОбласть("ЗапасыШапка");
		ОбластьЗапасы 			= Макет.ПолучитьОбласть("Запасы");
		Подвал 					= Макет.ПолучитьОбласть("Подвал");
		ОбластьНомерСтраницы    = Макет.ПолучитьОбласть("ОбластьНомерСтраницы");
		ОбластьПроверка    		= Макет.ПолучитьОбласть("ОбластьПроверка");
		ОбластьРазделитель  	= Макет.ПолучитьОбласть("ОбластьРазделитель");
		
		
		ТабДок.Очистить();
		
		ТабДок.АвтоМасштаб = Истина; 	
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(Шапка);
		
		ТабДок.Вывести(ОбластьЗапасыШапка);
		ВыборкаЗапасы = ВыборкаОбщийИтог.Выбрать();
		
		ТекущаяСтраница = 1;
		
		Пока ВыборкаЗапасы.Следующий() Цикл  
			
			Если Не ТабДок.ПроверитьВывод(ОбластьПроверка) Тогда
				ОбластьНомерСтраницы.Параметры.НомерСтраницы = ТекущаяСтраница;
				ТабДок.Вывести(ОбластьНомерСтраницы);
				
				ТекущаяСтраница = ТекущаяСтраница + 1;
				
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); // начнем новую страницу 
				
				ТабДок.Вывести(ОбластьРазделитель);    
				ТабДок.Вывести(ОбластьЗапасыШапка);
				
			КонецЕсли; 			
			
			ОбластьЗапасы.Параметры.Заполнить(ВыборкаЗапасы);
			ТабДок.Вывести(ОбластьЗапасы); 
			
			НомерСтроки = ВыборкаЗапасы.НомерСтроки;
			
		КонецЦикла;  
		
		// пустые сторки для лишних пакетов
		//й = 0;
		//НомерСтроки = Число(НомерСтроки);
		
		//Пока й < 5 Цикл
		//	й = й + 1;
		//	НомерСтроки = НомерСтроки + 1;
		//	
		//	Если Не ТабДок.ПроверитьВывод(ОбластьПроверка) Тогда
		//		ОбластьНомерСтраницы.Параметры.НомерСтраницы = ТекущаяСтраница;
		//		ТабДок.Вывести(ОбластьНомерСтраницы);
		//		
		//		ТекущаяСтраница = ТекущаяСтраница + 1;
		//		
		//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); // начнем новую страницу 
		//		
		//		ТабДок.Вывести(ОбластьРазделитель);    
		//		ТабДок.Вывести(ОбластьЗапасыШапка);
		//		
		//	КонецЕсли;
		//	
		//	ОбластьЗапасы.Параметры.НомерСтроки = НомерСтроки;
		//	ОбластьЗапасы.Параметры.Номенклатура = "";
		//	ОбластьЗапасы.Параметры.СерийныйНомер = "";
		//	ОбластьЗапасы.Параметры.КоличествоФакт = "";  
		//	ОбластьЗапасы.Параметры.КоличествоУчет = "";
		//	ОбластьЗапасы.Параметры.КоличествоИзлишки = "";
		//	ОбластьЗапасы.Параметры.КоличествоНедостача = "";
		
		//    ТабДок.Вывести(ОбластьЗапасы);			
		//
		//КонецЦикла;
		
		// подвал 
		
		ОбластьЗапасы.Параметры.Заполнить(ВыборкаОбщийИтог);		
		ОбластьЗапасы.Параметры.Номенклатура = "Итого:";    		
		ТабДок.Вывести(ОбластьЗапасы);
		
		Подвал.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(Подвал);
		
		Пока Истина Цикл
			
			Если Не ТабДок.ПроверитьВывод(ОбластьПроверка) Тогда
				ОбластьНомерСтраницы.Параметры.НомерСтраницы = ТекущаяСтраница;
				ТабДок.Вывести(ОбластьНомерСтраницы);
				Прервать;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьРазделитель); 
			
		КонецЦикла;  				
		
	КонецПроцедуры //СформироватьАктПриемки()	
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
